/*
Пусть дан список сотрудников:

Иван Иванов
Светлана Петрова
Кристина Белова
Анна Мусина
Анна Крутова
Иван Юрин
Петр Лыков
Павел Чернов
Петр Чернышов
Мария Федорова
Марина Светлова
Мария Савина
Мария Рыкова
Марина Лугова
Анна Владимирова
Иван Мечников
Петр Петин
Иван Ежов

А) Написать программу, которая найдёт и выведет повторяющиеся имена с количеством повторений.

Б) Отсортировать по убыванию популярности.
 */




public class TaskJava2 {
    public static void main(String[] args) {




    }
}
